
menus = "한식-불고기, 한식-생선조림, 한식-김치찌개, 한식-삼겹살, 분식-떡볶이, 분식-라면, 양식-파스타, 양식-피자, 양식-스테이크, 일식-초밥, 일식-회, 일식-라멘, 일식-덮밥, 일식-돈카츠, 중식-자장면, 중식-마라탕, 중식-볶음밥, 아시안-쌀국수, 아시안-커리, 패스트푸드-햄버거, 패스트푸드-치킨, 패스트푸드-샌드위치".split(',')
tastes = "단 맛, 짠 맛, 신 맛, 매운 맛, 기름진 맛, 향신료 향".split(',')

# 노랑, 빨강, 초록
colors = ['#fff5b1','#ffdce0','#dcffe4']

questions = {"나의 식당 판단 기준은?":["가성비가 중요","맛이 중요"]
           ,"혼자 식사를 해결해야할 때 나는?":["간단하게 때운다","먹고 싶던 식당에 방문"]
           ,"나의 혼밥 비율은?":["혼자 식사를 하지 않는다","대부분 혼자 식사를 한다"]
           ,"나는 대체로 음식을?":["가리는 편이다","가리지 않는 편이다"]
           ,"나는 식당을 고를 때 며칠 전 갔던 식당과":["똑같은 식당도 OK","무조건 달라야 한다"]
           ,"가려는 식당에 웨이팅이 있다":["발길을 돌린다","맛있다면 2시간까지 가능"]
           ,"저녁 식사 중 반주를 하자는 친구":["무슨 술이야..","이건 못참지!"]
           ,"4명의 친구들과 함께하는 식사":["친구들의 결정에 무조건 순응","메뉴와 식당을 적극 어필한다"]
           ,"매운 음식(마라탕, 카레, 떡볶이)를 먹으러 갔다. 나의 선택은?":["안 매운 맛","죽도록 매운 맛"]
           ,"나는 식당의 위생에":["심하지 않다면 별 신경쓰지 않는다","아주 예민하다"]
           ,"자고로 식당이란":["편한 식사를 위해 조용해야지","사람도 많고 복작복작 해야지"]
           ,"보통 일주일에 음주 횟수는":["전혀 마시지 않는다","5일 이상"]
           ,"바쁜 하루 중에":["식사를 자주 거른다","시간을 내서 꼭 식사를 한다"]}